claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
    LCDInstr(0x01);
     Delay1(1000);
      line_lcd=0;
    printf("\nDate:");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",years,mounts,date);
       date=adj(1,31,date);
    } while (!key_ok_on());


    //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nDays:");
      do
    {
      line_lcd=1;
     printf("\n%02d",days);
       days=adj(1,7,days);
    } while (!key_ok_on());



   //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nHours:");
      do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       hours=adj(0,23,hours);
    } while (!key_ok_on());

     line_lcd=0;
     printf("\nMinutes:");
      do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       minutes=adj(0,59,minutes);
    } while (!key_ok_on());

    line_lcd=0;
    printf("\nSeconds:");
    do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       seconds=adj(0,59,seconds);
    } while (!key_ok_on());

      // Set parameter to DS1307 + time byte
      Set_DS1307();

      //bool k=Check_DS1307();

  return TRUE;
}


u8 adj(u8 min,u8 max,u8 now)
{
   u8 adj=now;
   if (key_plus_on()) adj ++;
   if (adj >max) adj = min;
   if (key_minus_on()) adj --;
   if ( adj == 255) adj=max;
   if (adj < min) adj=max;
   return adj ;
}


bool key_ok_on()
{
  //Read Key OK
  if (!(GPIO_ReadInputData(GPIOF)& key_ok))
   {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time_ok) && !(GPIO_ReadInputData(GPIOF)& key_ok) );;
        if (timer2>=key_time_ok) return TRUE;
   }

  return FALSE;
}

 bool key_plus_on()
{
  //Read Key OK
    if (!(GPIO_ReadInputData(GPIOA)& key_plus))
     {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !(GPIO_ReadInputData(GPIOA)& key_plus) );;
        if (timer2>=key_time) return TRUE;
     }

  return FALSE;
}

  bool key_minus_on()
{
  //Read Key OK
   if (!(GPIO_ReadInputData(GPIOA)& key_minus))
     {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !(GPIO_ReadInputData(GPIOA)& key_minus) );;
        if (timer2>=key_time) return TRUE;
     }

  return FALSE;
}


bool  key_ok_plus()
{
  if (!((GPIO_ReadInputData(GPIOF)& key_ok)|(GPIO_ReadInputData(GPIOA)& key_plus)))
  {
      timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !((GPIO_ReadInputData(GPIOF)& key_ok)|(GPIO_ReadInputData(GPIOA)& key_plus)));;
       if (timer2>=key_time) return TRUE;
  }

 return FALSE;
}


bool Set_Delay_Allarm()
{

   //clr
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nH On:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
       daily_hour_on=adj(0,23,daily_hour_on);
    } while (!key_ok_on());

   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin On:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
       daily_minute_on=adj(0,59,daily_minute_on);
    } while (!key_ok_on());

    LCDInstr(0x01);
    Delay1(1000);
    line_lcd=0;
    printf("\nH Off:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_hour_off=adj(0,23,daily_hour_off);
    } while (!key_ok_on());

  LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin Off:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_minute_off=adj(0,59,daily_minute_off);
    } while (!key_ok_on());

     //Computing time_long_on

     u8 hour=daily_hour_on;
     u8 minute=daily_minute_on;
     daily_long_on=0;
     do
     {
          daily_long_on++;
          minute++;
          if (minute==60)
          {
            minute=0;
            hour++;
          }
          if(hour==24) hour=0;

     } while ( !((hour==daily_hour_off) & (minute==daily_minute_off)));

      //Display daily_long_on
    LCDInstr(0x01);
    Delay1(1000);
    line_lcd=0;
    printf("\nLong :");

      do
    {
     line_lcd=1;
     printf("\n%d",daily_long_on);
       //daily_long_on=adj(0,1440,daily_long_on);
    } while (!key_ok_on());

    time_on=daily_hour_on*60+daily_minute_on;
    time_off= daily_hour_off*60+daily_minute_off;
    //Save data to eeprom
     EEPROM_INIT();
     FLASH_ProgramByte(EEPROM_ADDR,daily_hour_on);
     FLASH_ProgramByte(EEPROM_ADDR+1,daily_minute_on);
     FLASH_ProgramByte(EEPROM_ADDR+2,daily_hour_off);
     FLASH_ProgramByte(EEPROM_ADDR+3,daily_minute_off);

   return TRUE;

}

bool Read_Allarm()
{
   daily_hour_on=FLASH_ReadByte(EEPROM_ADDR);
   daily_minute_on=FLASH_ReadByte(EEPROM_ADDR+1);
   daily_hour_off=FLASH_ReadByte(EEPROM_ADDR+2);
   daily_minute_off=FLASH_ReadByte(EEPROM_ADDR+3);
     // Computting daily_long_on
     u8 hour=daily_hour_on;
     u8 minute=daily_minute_on;
     daily_long_on=0;
     do
     {
          daily_long_on++;
          minute++;
          if (minute==60)
          {
            minute=0;
            hour++;
          }
          if(hour==24) hour=0;

     } while ( !((hour==daily_hour_off) & (minute==daily_minute_off)));

  return TRUE;
}

void EEPROM_INIT()
{
  FLASH_DeInit();
  FLASH_Unlock(FLASH_MEMTYPE_DATA);
  FLASH_SetProgrammingTime(FLASH_PROGRAMTIME_STANDARD);



}


void GpioConfiguration()
{

  GPIO_Init(LCD_PORT,(GPIO_Pin_TypeDef)LCD_GPIO_PIN,GPIO_MODE_OUT_PP_HIGH_FAST);

  // ADC PE6 NEW PB0
  GPIO_Init(GPIOB,GPIO_PIN_0,GPIO_MODE_IN_FL_NO_IT);

  // PD6/UART2_RX   PD5/UART2_TX  No need to init  PD7 485 R/W;
  GPIO_Init(GPIOD,GPIO_PIN_7,GPIO_MODE_OUT_PP_HIGH_FAST);

  //PD0 Led
  GPIO_Init(GPIOD,GPIO_PIN_0,GPIO_MODE_OUT_PP_HIGH_FAST);
  //I2C
  GPIO_Init(GPIOB,GPIO_PIN_4 ,GPIO_MODE_OUT_OD_HIZ_FAST);
  GPIO_Init(GPIOB,GPIO_PIN_5 ,GPIO_MODE_OUT_OD_HIZ_FAST);
  // Remap Pins pb4,pb5  sda,scl ;

   //Init KEY OK,PLUS,MINUS
  GPIO_Init(GPIOF,key_ok,GPIO_MODE_IN_PU_NO_IT);
  GPIO_Init(GPIOA,key_plus,GPIO_MODE_IN_PU_NO_IT);
  GPIO_Init(GPIOA,key_minus,GPIO_MODE_IN_PU_NO_IT);

  //Init DS18b20 data pin
  GPIO_Init(GPIOD,ds18_data,GPIO_MODE_OUT_OD_HIZ_FAST);

